In [1]:
import pandas as pd
import numpy as np

In [2]:
y=np.array([23,3.,45,36]) # if one  is float other also become float
s2=pd.Series(y,index=['a','b','c','d'])
print(s2)

a    23.0
b     3.0
c    45.0
d    36.0
dtype: float64

In [3]:
print(s2.values)
print(s2.index)
print(s2.size)
print(s2.shape)

[23.  3. 45. 36.]
Index(['a', 'b', 'c', 'd'], dtype='object')
4
(4,)

In [4]:
# Accessing the element by indexing and slicing 
print("third element: ",s2[3])  # indexing
print("first two element:\n")
print(s2[0:2])  # slicing
print("element having index 'a': ")
print(s2['a'])  # indexing

third element:  36.0
first two element:

a    23.0
b     3.0
dtype: float64
element having index 'a':
23.0

In [5]:
# replacing the values
s2['a']=10
s2[1]=11
s2

a    10.0
b    11.0
c    45.0
d    36.0
dtype: float64

In [6]:
df=pd.Series(['Amit','Kate','A','b',np.nan,'Car','dog','cat'])
df

0    Amit
1    Kate
2       A
3       b
4     NaN
5     Car
6     dog
7     cat
dtype: object

In [7]:
print(df.str.lower()) # converting into lower case

0    amit
1    kate
2       a
3       b
4     NaN
5     car
6     dog
7     cat
dtype: object

In [8]:
print(df.str.upper()) # converting into upper case

0    AMIT
1    KATE
2       A
3       B
4     NaN
5     CAR
6     DOG
7     CAT
dtype: object

In [9]:
print(df.str.len())  # checking length of element

0    4.0
1    4.0
2    1.0
3    1.0
4    NaN
5    3.0
6    3.0
7    3.0
dtype: float64

### Removing Space

In [10]:
df1=pd.Index([' Arya','John ',' Jack ','sam'])
df1

Index([' Arya', 'John ', ' Jack ', 'sam'], dtype='object')

In [11]:
print(df1.str.strip())  # removing space from both side

Index(['Arya', 'John', 'Jack', 'sam'], dtype='object')

In [12]:
print(df1.str.lstrip())

Index(['Arya', 'John ', 'Jack ', 'sam'], dtype='object')

In [13]:
print(df1.str.rstrip())

Index([' Arya', 'John', ' Jack', 'sam'], dtype='object')

##### Question 1:

Perform the following Pandas Operations

    1) From the raw data below create a data frame
    
    'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
    'last_name': ['Miller', 'Jacobson', ".", 'Milner', 'Cooze'], 
    'age': [42, 52, 36, 24, 73], 
    'preTestScore': [4, 24, 31, ".", "."],
    'postTestScore': ["25,000", "94,000", 57, 62, 70]

    2) Save the dataframe into a csv file as example.csv
    3) Read the example.csv and print the data frame
    4) Read the example.csv without column heading
    5) Read the example.csv and make the index columns as 'First Nameâ€™ and 'Last   Name'
    6) Read the first 3 rows of the dataFrame and print the dataFrame
    7) The column 'postTestScore' has "," in their values around numbers to represent thousands. Load example.csv file which ignores the default behaviour of comma while reading the 'postTestScore' column

In [14]:
raw_data={'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
'last_name': ['Miller', 'Jacobson', ".", 'Milner', 'Cooze'], 
'age': [42, 52, 36, 24, 73], 
'preTestScore': [4, 24, 31, ".", "."],
'postTestScore': ["25,000", "94,000", 57, 62, 70]}
df=pd.DataFrame(raw_data)
df

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57
3       Jake    Milner   24            .            62
4        Amy     Cooze   73            .            70

In [35]:
df.to_csv("example.csv")

In [36]:
df=pd.read_csv("example.csv")
df

   Unnamed: 0 first_name last_name  age preTestScore postTestScore
0           0      Jason    Miller   42            4        25,000
1           1      Molly  Jacobson   52           24        94,000
2           2       Tina         .   36           31            57
3           3       Jake    Milner   24            .            62
4           4        Amy     Cooze   73            .            70

In [37]:
df1=pd.read_csv("example.csv",header=None)
df1

     0           1          2    3             4              5
0  NaN  first_name  last_name  age  preTestScore  postTestScore
1  0.0       Jason     Miller   42             4         25,000
2  1.0       Molly   Jacobson   52            24         94,000
3  2.0        Tina          .   36            31             57
4  3.0        Jake     Milner   24             .             62
5  4.0         Amy      Cooze   73             .             70

In [54]:
df=pd.read_csv('example.csv', header=0, index_col=['First Name','Last Name'], 
               names=['ID', 'First Name', 'Last Name', 'Age', 'Pre-Test Score', 'Post-Test Score'])
df

                      ID  Age Pre-Test Score Post-Test Score
First Name Last Name
Jason      Miller      0   42              4          25,000
Molly      Jacobson    1   52             24          94,000
Tina       .           2   36             31              57
Jake       Milner      3   24              .              62
Amy        Cooze       4   73              .              70

In [44]:
df=pd.read_csv('example.csv',nrows=3)
df

   Unnamed: 0 first_name last_name  age  preTestScore postTestScore
0           0      Jason    Miller   42             4        25,000
1           1      Molly  Jacobson   52            24        94,000
2           2       Tina         .   36            31            57

In [45]:
df.head(3)

   Unnamed: 0 first_name last_name  age  preTestScore postTestScore
0           0      Jason    Miller   42             4        25,000
1           1      Molly  Jacobson   52            24        94,000
2           2       Tina         .   36            31            57

In [46]:
df=pd.read_csv('example.csv',thousands=",")
df

   Unnamed: 0 first_name last_name  age preTestScore  postTestScore
0           0      Jason    Miller   42            4          25000
1           1      Molly  Jacobson   52           24          94000
2           2       Tina         .   36           31             57
3           3       Jake    Milner   24            .             62
4           4        Amy     Cooze   73            .             70